/**
 * Компонент с фразами
 *
 * @author Markitanov Vadim
 * @since 22.04.2023
 */
import React from 'react'

const Phrases = (): JSX.Element => {
  return (
    <div>
      <h3>На базаре</h3>
      - Сизде алмурут барбы? <i>(- У вас есть груша?)</i> <br/>
      - Ооба, бар. <i>(- Да, есть.)</i> <br/>
      - Сизге канча керек? <i>(- Сколько вам нужно?)</i> <br/>
      - Бир кило керек. <i>(- Нужен один килограмм.)</i> <br/>
      - Канча турат? <i>(- Сколько стоит?)</i> <br/>
      - Жыйырма бештен. <i>(- По 25.)</i> <br/>
    </div>
  )
}

export default Phrases
