/**
 * Компонент с фразами
 *
 * @author Markitanov Vadim
 * @since 22.04.2023
 */
import React from 'react'
import PhraseItem from './PhraseItem'

const Phrases = (): JSX.Element => {
  return (
    <div>
      <h3>Приветствие <i>(Саламдашуу)</i></h3>
      - Салам <i>(- Привет)</i> <br/>
      - Здравствуйте <i>(- Саламатсызбы)</i> <br/>
      <h3>Знакомство <i>(Таанышуу)</i></h3>
      - Менин атым ... <i>(- Меня зовут ...)</i> <br/>
      - Мен ... болом. <i>(- Я из ...)</i> <br/>
      <h3>На базаре</h3>
      - Сизде алмурут барбы? <i>(- У вас есть груша?)</i> <br/>
      - Ооба, бар. <i>(- Да, есть.)</i> <br/>
      - Сизге канча керек? <i>(- Сколько вам нужно?)</i> <br/>
      - Бир кило керек. <i>(- Нужен один килограмм.)</i> <br/>
      - Канча турат? <i>(- Сколько стоит?)</i> <br/>
      - Жыйырма бештен. <i>(- По 25.)</i> <br/>
      <h3>Бул / тиги</h3>
      <PhraseItem kg={'Бул эмне?'} ru={'Что это?'}/>
      <PhraseItem kg={'Бул жаңы университет.'} ru={'Это новый университет.'}/>
      <PhraseItem kg={'Кандай кооз!'} ru={'Какой красивый!'}/>
      <PhraseItem kg={'Тигичи?'} ru={'А то?'}/>
      <PhraseItem kg={'Тиги кинотеатр.'} ru={'То кинотеатр.'}/>
      <br/>
      <PhraseItem kg={'Бул кандай гезит?'} ru={'Это какая газета?'}/>
      <PhraseItem kg={'Бул "Вечерний Бишкек".'} ru={'Это "Вечерний Бишкек".'}/>
      <PhraseItem kg={'Бул кызыктуу гезит.'} ru={'Это интересная газета.'}/>
      <PhraseItem kg={'Бул журналчы?'} ru={'А это журнал?'}/>
      <PhraseItem kg={'Бул журнал дагы абдан кызыктуу.'} ru={'Этот журнал тоже очень интересный.'}/>
      <br/>
      <PhraseItem kg={'Бул сүрөтчү жакшыбы?'} ru={'Этот художник хороший?'}/>
      <PhraseItem kg={'Ооба, ал жакшы.'} ru={'Да, он хороший.'}/>
      <PhraseItem kg={'Тиги сүрөтчүчү?'} ru={'А тот художник?'}/>
      <br/>
      <PhraseItem kg={'Бул Каракол шаарбы же айылбы?'} ru={'Каракол - это город или село?'}/>
      <PhraseItem kg={'Бул шаар.'} ru={'Это город.'}/>
      <PhraseItem kg={'Ал чоңбу же киченекейби?'} ru={'Он большой или маленький?'}/>
      <PhraseItem kg={'Ал чоң эмес.'} ru={'Он небольшой.'}/>
      <br/>
      <PhraseItem kg={'Бул кызыктуу тасмабы?'} ru={'Это интересный фильм?'}/>
      <PhraseItem kg={'Бул тасма кызыктуубу?'} ru={'Этот фильм интересный?'}/>
      <br/>
      <PhraseItem kg={'Бул жоолук жаңыбы?'} ru={'Этот платок новый?'}/>
      <PhraseItem kg={'Бул жаңы жоолукпу?'} ru={'Это новый платок?'}/>
      <br/>
      <PhraseItem kg={'Тиги үй эскиби?'} ru={'Тот дом старый?'}/>
      <PhraseItem kg={'Тиги уй эскиби?'} ru={'Та корова старая?'}/>
      <br/>
      <PhraseItem kg={'Үй коозбу?'} ru={'Дом красивый?'}/>
      <PhraseItem kg={'Короо чоңбу?'} ru={'Двор большой?'}/>
      <br/>
      <PhraseItem kg={'Суроолоруңар барбы?'} ru={'Вопросы есть?'}/>
      <PhraseItem kg={'Эртең сабак саат канчада болот?'} ru={'Во сколько будет завтрашний урок?'}/>
      <PhraseItem kg={'Эртең сабагыбыз беш жарымда башталат.'}
                  ru={'Наш завтрашний урок будет в пять с половиной (в 17:30).'}/>

    </div>
  )
}

export default Phrases
