/**
 * Компонент общей информации
 *
 * @author Markitanov Vadim
 * @since 19.05.2023
 */
import React from 'react'

const AboutAffix = (): JSX.Element => {
  return (
    <>
      <b>Аффикс</b> (лат. affixis – прикрепленный) (Мүчө) – служебная
      морфема, которая самостоятельно без корня не употребляется, служит
      для образования различных форм одного и того же слова или
      образования другого однокоренного слова. Таким образом, аффиксы
      делятся на формообразующие и словообразовательные.
    </>
  )
}

export default AboutAffix
