/**
 * Компонент "Согласная Л. Согласная Б.
 *
 * @author Markitanov Vadim
 * @since 26.05.2023
 */
import React from 'react'

const Lesson24 = (): JSX.Element => {
  return (
    <>
      <ol>
        <li>
          <p>
            В кыргызском языке <b>Ь</b> не употребляется. Встречается он только в заимствованных словах. Например: факультет, циркуль. Но рядом с мягкими гласными <b>Л</b> произносится мягко. Например: өлкө, пил, тил, үлгү, көл.
          </p>
        </li>
        <li>
          <p>
            Звук <b>Б</b> произносится двояко. В начале слова или рядом с согласными произносится как и Б в русском. Например: баруу, балык, ишемби, жабдык. В позиции же между гласными Б становится щелевым. Например: жабык, кабат, дубал.
          </p>
        </li>
      </ol>
    </>
  )
}

export default Lesson24
