/**
 * Компонент "Согласные К и Г. Согласная Ж
 *
 * @author Markitanov Vadim
 * @since 26.05.2023
 */
import React from 'react'

const Lesson23 = (): JSX.Element => {
  return (
    <>
      <ol>
        <li>
          <p>
            Звуки <b>К</b> и <b>Г</b> в кыргызском языке имеют два варианта произношения. В одним случаях их произношение не отличается от русского (<i>кисет</i> - келет, <i>гид</i> - гүл). <b>К</b> и <b>Г</b> произносятся так перед мягкими гласными.
          </p>
          <p>
            В других случаях их произношение характерно только кыргызского языка. <b>К</b> и <b>Г</b> произносятся твердо, являются заднеязычными (кырк, агып).
          </p>
        </li>
        <li>
          <p>
            Звук <b>Ж</b> в заимствованных русских словах произносится как русский звук <b>Ж</b> (журнал, жанр).
          </p>
          <p>
            В кыргызских словах он произносится как сдвоенный и смягченный звук <b>ДЖ</b> (жаңы, жөжө).
          </p>
        </li>
      </ol>
    </>
  )
}

export default Lesson23
